---
kind: property
id: P:Autodesk.Revit.DB.TextRange.End
source: html/ed1acbf0-2425-31bd-99e2-1f596cc57fd2.htm
---
# Autodesk.Revit.DB.TextRange.End Property

The index of the first character after the end of the range

## Syntax (C#)
```csharp
public int End { get; }
```